

# **************************************************************************
# функция определение кол-ва пиков гистограмм
# вход: 1) hist - массив гистограммы
#       2) size_mas - размер массива hist
# выход: N_peak - количество пиков
# **************************************************************************

import numpy as np


def CalcNumPeakHist(hist=None, size_mas=None):
    N_peak = 0
# **************************************************************************
# **************************************************************************
    if (hist(1) > 0):
        calc = 1
    else:
        calc = - 1

    for i in np.arange(2, size_mas+1).reshape(-1):
        if ((hist[i - 1] > hist[i]) and (calc > 0)):
            N_peak = N_peak + 1
            calc = - 1
        if ((hist[i - 1] < hist[i]) and (calc < 0)):
            calc = 1

    return N_peak
# **************************************************************************
